const fs = require("fs-extra");

module.exports = {
	config: {
		name: "rules",
		version: "1.0",
		author: "Arafat",
		countDown: 5,
		role: 0,
		description: "Show group rules",
		category: "info",
		guide: {
			en: "{pn}: Show group rules"
		}
	},

	onStart: async function ({ message }) {
		return message.reply(`⏤͟͟͞͞♥︎𝐌𝐨𝐨𝐧𝐋𝐢𝐠𝐡𝐭♥︎ [ 𝐅ᴀᴍɪʟʏ ]🌙🚩
🔰Group Rules :

১/ গ্রুপের সবাইকে সম্মান করতে হবে সে বড় হোক বা ছোট।

২/ অপরিচিত কেউকে প্রয়োজন ছাড়া ইনবক্সে মেসেজ দেওয়া যাবে না বা জ্বালানো যাবে না।

৩/ গ্রুপে কোন একাধারে একটা stricker অধিক বার দেওয়া যাবেনা। অপরিচিত কারো সাথে কথা বলার সময় বাজে ইমোজি ইউজ করা যাবে না।

৪/ ধর্ম বিরোধী কোনো কথা বলা যাবে না বা ধর্ম নিয়ে কাউকে ছোট করা বা খোচা মারা যাবে না।

৫/ Bts বা কোনো K-pop Idol দের নিয়ে কথা বলা যাবেনা। যদিও বলে থাকে তাহলে কেউ উল্টাপাল্টা বক্তব্য দিবেন না।

৬/ গ্রুপে জয়েন হয়ে নিজের পরিচয় দিতে হবে এবং সবার সাথে পরিচয় হতে হবে।

৭/ গ্রুপে কোনো সমস্যা হলে যদি leader রা বলে Text off, তাহলে Text off করবে!!না করলে কিক খাবে।

৮/ Toxic পিক+বিডিও & কথা বার্তা বলা যাবে না।

★★★সব Rules গুলো পড়ার পরেও যদি কেউ ইচ্ছাকৃতভাবে কোন ভুল করে তাহলে তাকে কোনো Warning  দেওয়া হবে!! 2nd বার আবার সেই ভুল করলে কোন warning দেওয়া হবেনা,Directly কিক দেওয়া হবে‼️⚠️
By Arafat ❤️`);
	},

	onChat: async function ({ event, message }) {
		if (!event.body) return;

		const text = event.body.trim().toLowerCase();

		if (["rules", "rules/", "rules text", "rules/ text"].includes(text)) {
			return message.reply(`⏤͟͟͞͞♥︎𝐌𝐨𝐨𝐧𝐋𝐢𝐠𝐡𝐭♥︎ [ 𝐅ᴀᴍɪʟʏ ]🌙🚩
🔰Group Rules :

১/ গ্রুপের সবাইকে সম্মান করতে হবে সে বড় হোক বা ছোট।

২/ অপরিচিত কেউকে প্রয়োজন ছাড়া ইনবক্সে মেসেজ দেওয়া যাবে না বা জ্বালানো যাবে না।

৩/ গ্রুপে কোন একাধারে একটা stricker অধিক বার দেওয়া যাবেনা। অপরিচিত কারো সাথে কথা বলার সময় বাজে ইমোজি ইউজ করা যাবে না।

৪/ ধর্ম বিরোধী কোনো কথা বলা যাবে না বা ধর্ম নিয়ে কাউকে ছোট করা বা খোচা মারা যাবে না।

৫/ Bts বা কোনো K-pop Idol দের নিয়ে কথা বলা যাবেনা। যদিও বলে থাকে তাহলে কেউ উল্টাপাল্টা বক্তব্য দিবেন না।

৬/ গ্রুপে জয়েন হয়ে নিজের পরিচয় দিতে হবে এবং সবার সাথে পরিচয় হতে হবে।

৭/ গ্রুপে কোনো সমস্যা হলে যদি leader রা বলে Text off, তাহলে Text off করবে!!না করলে কিক খাবে।

৮/ Toxic পিক+বিডিও & কথা বার্তা বলা যাবে না।

★★★সব Rules গুলো পড়ার পরেও যদি কেউ ইচ্ছাকৃতভাবে কোন ভুল করে তাহলে তাকে কোনো Warning  দেওয়া হবে!! 2nd বার আবার সেই ভুল করলে কোন warning দেওয়া হবেনা,Directly কিক দেওয়া হবে‼️⚠️
By Arafat ❤️`);
		}
	}
};
